In [1]:
import pandas as pd

In [98]:
company_size = pd.read_csv('../Labs files/course-files/StackOverflowDeveloperSurvey.csv',
                    usecols=['CompanySize']).dropna()

In [99]:
company_size.head()

                CompanySize
1        20 to 99 employees
2  10,000 or more employees
3  10,000 or more employees
4        10 to 19 employees
6        20 to 99 employees

In [100]:
company_size.iloc[3]

CompanySize    10 to 19 employees
Name: 4, dtype: object

In [101]:
company_size.loc[3]

CompanySize    10,000 or more employees
Name: 3, dtype: object

In [102]:
company_size.iloc[0:10]

                 CompanySize
1         20 to 99 employees
2   10,000 or more employees
3   10,000 or more employees
4         10 to 19 employees
6         20 to 99 employees
7    Fewer than 10 employees
8   5,000 to 9,999 employees
10      100 to 499 employees
11      100 to 499 employees
13   Fewer than 10 employees

In [103]:
company_size.loc[0:10]

                 CompanySize
1         20 to 99 employees
2   10,000 or more employees
3   10,000 or more employees
4         10 to 19 employees
6         20 to 99 employees
7    Fewer than 10 employees
8   5,000 to 9,999 employees
10      100 to 499 employees

In [104]:
company_size.loc[12345]

CompanySize    20 to 99 employees
Name: 12345, dtype: object

In [105]:
company_size.loc[12341:12350]

                    CompanySize
12342  1,000 to 4,999 employees
12343  10,000 or more employees
12344      100 to 499 employees
12345        20 to 99 employees
12347   Fewer than 10 employees
12348        20 to 99 employees
12349        20 to 99 employees
12350        20 to 99 employees

In [106]:
company_size.sort_values('CompanySize', inplace=True)

In [107]:
company_size.loc[3]

CompanySize    10,000 or more employees
Name: 3, dtype: object

In [108]:
company_size.iloc[3]

CompanySize    1,000 to 4,999 employees
Name: 43102, dtype: object

In [109]:
company_size.reset_index(drop=True, inplace=True)

In [110]:
company_size.head()

                CompanySize
0  1,000 to 4,999 employees
1  1,000 to 4,999 employees
2  1,000 to 4,999 employees
3  1,000 to 4,999 employees
4  1,000 to 4,999 employees

In [115]:
company_size.loc[1444]

CompanySize    1,000 to 4,999 employees
Name: 1444, dtype: object

In [116]:
company_size.iloc[1444]

CompanySize    1,000 to 4,999 employees
Name: 1444, dtype: object